#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ecs.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-prod]
module.ecs.module.cluster.data.aws_partition.current: Reading...
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.ecs.module.service["django_prod"].data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
module.autoscaling.data.aws_partition.current: Reading...
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs.module.service["django_prod"].data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/django-app]
module.autoscaling.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.service["django_prod"].data.aws_partition.current: Reading...
module.ecs.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.service["django_prod"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.service["django_prod"].data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
data.aws_availability_zones.aws_azs: Reading...
data.aws_ami.ecs_ami: Reading...
module.autoscaling.data.aws_default_tags.current: Reading...
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.autoscaling.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs.module.service["django_prod"].data.aws_caller_identity.current: Read complete after 0s [id=954050840447]
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs.module.service["django_prod"].data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3252303218]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
data.aws_availability_zones.aws_azs: Read complete after 0s [id=eu-west-1]
aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=django-app-log-stream]
data.aws_ami.ecs_ami: Read complete after 1s [id=ami-098220853f4644225]
module.autoscaling.aws_launch_template.this[0]: Refreshing state... [id=lt-05aebd499e3077330]
module.ecs.module.cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:cluster/django-prod]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-032cfc42b7478e925]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-86115656]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1143663398]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3]: Refreshing state... [id=sgrule-2473780471]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3552822451]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3522305327]
module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-441417626]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a477dbbde07c0098]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e0b862f487d38fd]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:loadbalancer/app/django-elb/3d0916a3c7717f9e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d2d71fa8544ec8c]
module.autoscaling.aws_autoscaling_group.this[0]: Refreshing state... [id=django_ecs_auto_scaling_group-20231012145500702700000001]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3]
module.ecs.module.cluster.aws_ecs_capacity_provider.this["on-demand"]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:capacity-provider/on-demand]
module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=django-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.autoscaling.aws_autoscaling_group.this[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                               = "django_ecs_auto_scaling_group-20231012145500702700000001"
        name                             = "django_ecs_auto_scaling_group-20231012145500702700000001"
        # (27 unchanged attributes hidden)

      - tag {
          - key                 = "AmazonECSManaged" -> null
          - propagate_at_launch = true -> null
        }

        # (5 unchanged blocks hidden)
    }

  # module.ecs.module.service["django_prod"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "django_prod"
      + task_role_arn        = (known after apply)
    }

  # module.ecs.module.service["django_prod"].aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode([])
      + cpu                      = "10"
      + execution_role_arn       = (known after apply)
      + family                   = "django_prod"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all                 = {
          + "ManagedBy" = "Terraform"
        }
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.module.service["django_prod"].aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn         = (known after apply)
      + description = "Task execution role IAM policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "django_prod-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = "GetSSMParams"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecs.module.service["django_prod"].aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for django_prod"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "django_prod-"
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all              = {
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.module.service["django_prod"].aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:eu-west-1:954050840447:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "954050840447"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "django_prod-"
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all              = {
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.module.service["django_prod"].aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*